app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('c1', 1, '2017-04-16 17:57:40', '2017-04-16 17:57:40')

    def set_company
      @company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1