app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT `properties`.* FROM `properties`

  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save
---
INSERT INTO `properties` (`address`, `company_id`, `property_type_id`, `property_status_id`, `created_at`, `updated_at`) VALUES ('1', 1, 1, 1, '2017-04-19 14:04:28', '2017-04-19 14:04:28')

    def set_property
      @property = Property.find(params[:id])
---
SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1