app/controllers/property_statuses_controller.rb

  def index
    @property_statuses = PropertyStatus.all
---
SELECT `property_statuses`.* FROM `property_statuses`

  def create
    @property_status = PropertyStatus.new(property_status_params)

    respond_to do |format|
      if @property_status.save
---
INSERT INTO `property_statuses` (`code`, `name`, `created_at`, `updated_at`) VALUES ('1', '1', '2017-04-19 14:02:13', '2017-04-19 14:02:13')

    def set_property_status
      @property_status = PropertyStatus.find(params[:id])
---
SELECT  `property_statuses`.* FROM `property_statuses` WHERE `property_statuses`.`id` = 1 LIMIT 1