app/controllers/property_details_controller.rb

SELECT `property_details`.* FROM `property_details`
---
  def index
    @property_details = PropertyDetail.all

INSERT INTO `property_details` (`code`, `created_at`, `updated_at`) VALUES ('1', '2017-04-18 16:37:43', '2017-04-18 16:37:43')
---
  def create
    @property_detail = PropertyDetail.new(property_detail_params)

    duplicate_detail_id = property_detail_extended_params[:duplicate_detail_id]
    types_need_update = property_detail_extended_params[:types_need_update]

    respond_to do |format|
      if @property_detail.save

UPDATE `property_details` SET `name` = 'price', `updated_at` = '2017-04-18 16:42:05' WHERE `property_details`.`id` = 4
---
  def update
    # check if value options or value type will change and the details is already used

    value_type_changed = @property_detail.value_type != property_detail_params[:value_type]

    value_options_changed = value_options_changed?(
      @property_detail.property_detail_value_options,
      property_detail_params[:property_detail_value_options_attributes])

    if((value_type_changed || value_options_changed) &&
      !Property.get_affected_with_property_detail(@property_detail.id).empty?)

      affected_properties = Property.get_affected_with_property_detail(@property_detail.id)
      affected_types = PropertyType.get_affected_with_property_detail(@property_detail.id)

      response = {affected_properties: affected_properties, affected_types: affected_types}

      puts response.to_json
      render json: response, status: :multi_status
    else
      respond_to do |format|
        if @property_detail.update(property_detail_params)

SELECT  `property_details`.* FROM `property_details` WHERE `property_details`.`id` = 4 LIMIT 1
---
  def set_property_detail
    @property_detail = PropertyDetail.find(params[:id])