app/controllers/property_states_controller.rb

  def index
    @property_states = PropertyState.all
---
SELECT `property_states`.* FROM `property_states`

  def create
    @property_state = PropertyState.new(property_state_params)

    respond_to do |format|
      if @property_state.save
---
INSERT INTO `property_states` (`code`, `name`, `created_at`, `updated_at`) VALUES ('1', '1', '2017-04-19 11:07:23', '2017-04-19 11:07:23')

    def set_property_state
      @property_state = PropertyState.find(params[:id])
---
SELECT  `property_states`.* FROM `property_states` WHERE `property_states`.`id` = 1 LIMIT 1