app/controllers/property_types_controller.rb

  def index
    @property_types = PropertyType.all
---
SELECT `property_types`.* FROM `property_types`

  def create
    @property_type = PropertyType.new(property_type_params)

    respond_to do |format|
      if @property_type.save
---
INSERT INTO `property_types` (`code`, `created_at`, `updated_at`) VALUES ('1', '2017-04-18 15:57:58', '2017-04-18 15:57:58')

    def set_property_type
      @property_type = PropertyType.find(params[:id])
---
SELECT  `property_types`.* FROM `property_types` WHERE `property_types`.`id` = 1 LIMIT 1