app/controllers/property_service_types_controller.rb

SELECT `property_service_types`.* FROM `property_service_types`
---
  def index
    @property_service_types = PropertyServiceType.all