app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = @users
                .joins('LEFT JOIN company_users cu2 ON users.id = cu2.user_id')
                .order(role: :asc)
                .order('company_users.company_id')
                .includes(company_user: :company)

    filtering_params(params).each do |scope, value|

INSERT INTO `users` (`email`, `password_salt`, `crypted_password`, `persistence_token`, `single_access_token`, `perishable_token`, `created_at`, `updated_at`) VALUES ('base@accorpa.com', 'nHQf4twusTCafIf3yAUF', '400$8$37$2a75a58500e35798$9034c41ddf05c3c6c9c1086c0396cfd5ba4f68f743ba7ddddd8de73f8c397b5c', '301d12a0c69df3f9b5847caa8666d821fdf924e759039c0def23f34fa255e07de023f0d42fc0e8b5d1489489159dfba0e0e4cdc8ec770a9a4211776ce57824a5', 'caj7VpMPCk2Lq4p9BT', 'HxlEQiS1bfLqM8KEFEJ', '2017-04-16 11:32:09', '2017-04-16 11:32:09')
---

        @user = User.new(user_params)
        @user.role = :company_user
        @user.save!