app/controllers/user_invitations_controller.rb

SELECT `user_invitations`.* FROM `user_invitations`
---
  def index
    @user_invitations = UserInvitation.all

INSERT INTO `user_invitations` (`reciever_email`, `reciever_name`, `created_at`, `updated_at`) VALUES ('f', 'f', '2017-04-20 11:13:19', '2017-04-20 11:13:19')
---
  def create
        puts "ppppppppppppppppp"

    user_invitation_params = {reciever_email: user_params[:email],
                                      user_id: current_user.id,
                                      company_id: current_user.company_user.company_id,
                                      random_key: Digest::SHA1.hexdigest([Time.now, rand].join)}
        puts "ppppppppppppppppp"

    @user_invitation = UserInvitation.new(user_invitation_params)
    # @user_invitation = UserInvitation.new(user_invitation_params)
    puts "ppppppppppppppppp"
    respond_to do |format|
      if @user_invitation.save

SELECT  `user_invitations`.* FROM `user_invitations` WHERE `user_invitations`.`id` = 1 LIMIT 1
---
    def set_user_invitation
      @user_invitation = UserInvitation.find(params[:id])